//Cavasin Riccardo

#include<stdio.h>
#include<stdlib.h>
#include<string.h>
#include<termios.h>
#include<unistd.h>
#include<time.h>

struct ssprite{
	int **mna,sx,sy;
	struct ssprite *nxt,*pre;
};
typedef struct ssprite sprite;

struct sobj{
	int n;
	char name[6];
	sprite *head;
};
typedef struct sobj obj;

void sleepm(int milliseconds){
	clock_t time_end;
	time_end=clock()+milliseconds*CLOCKS_PER_SEC/1000;
	while(clock()<time_end);
}

int getch(int m){
	struct termios old,new;
	int c;

	tcgetattr(STDIN_FILENO,&old);
	new=old;
	new.c_lflag&=~(ICANON|ECHO);
	tcsetattr(STDIN_FILENO,TCSANOW,&new);
	c=getchar();
	tcsetattr(STDIN_FILENO,TCSANOW,&old);
	if(!m&&c=='\033'){
		getchar();
		c=getchar();
	}
return c;
}

void sysbr(int mode,char *b,char *c){
	char a[31];

	switch(mode){
		case 0:
			sprintf(a,"cat %s/%s.txt",b,c);
		break;
		case 1:
			sprintf(a,"mv obj/%s.obj obj/%s.obj",b,c);
		break;
	}
	system(a);
}

void freem(int **mna,int sx){
	for(sx--;sx>-1;free(mna[sx]),sx--);
	free(mna);
}

int rd(){
	int a=getchar()-48;
	while(getchar()!='\n');
return a;
}

int spe(int i){
	switch(i){
		case 127://l
			i=0;
		break;
		case 0://' '
			printf("[ special:   ]\b\b\b");
			i=getch(0)-48;
			if(i<1||i>9)
				i=-127;
		break;
		default:
			if(i<32||i>126)
				i=-i;
		break;
	}
return i;
}

void	bootanim(int m);
void	editor(obj o);
void	o_load(obj *o,int *n);
int		o_scan(FILE *a,char b[]);
void	o_make(FILE *a,obj *o);
sprite* o_add(sprite *head,sprite *s);
sprite* o_new(int **mna,int sx,int sy);
sprite*	o_delete(sprite *head,sprite *s);
void	o_swap(sprite *head,sprite *s,int a);
void	o_move(sprite *s,sprite *p);
void	o_clone(sprite *s);
void	o_panorama(sprite *head,int n);
int		o_name(char n[],int ste);
void	o_save(obj o);
sprite* spriter(sprite *s,int ste);
int**	s_load(int *sx,int *sy,int *n);
int		s_scan(FILE *a,char b[]);
int**	s_make(FILE *a,int *sx,int *sy);
void	s_show(int **mna,int sx,int sy,int g);
int**	s_draw(int **mna,int *sx,int *sy,int *n);
void	s_invert(int **mna,int sx,int sy,int ste);
void	s_mirror(int **mna,int sx,int sy);
int**	s_resize(int **mna,int *sx,int *sy,int m,int ste);
int**	s_rotate(int **mna,int *sx,int *sy,int ste);
void	s_fill(int **mna,int sx,int sy,int x,int y,int b,int p);
void	s_print(int**mna,int sx,int sy);

int main(int argc, char**argv){
	int n;
	obj o;
	system("stty -ixon");//enable ctrl+s/q key

	if(argc==2&&!strcmp(argv[1],"-t"))
		bootanim(0);
	else
		bootanim(1);
	do{
		o.head=NULL;
		printf("\033c");
		printf(" ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │ What do you want to do:                             │\n │                                                     │\n │ 1. load an obj                                      │\n │ 2. create a new obj                                 │\n │ 0. exit                                             │\n                                                       │\n └─────────────────────────────────────────────────────┘\033[F │ ☛  ");
		n=rd();
		switch(n){
			case 1:
				printf(" ┴ ┄┄╌─────────────────────────────────────────────╌┄┄ ┴\n");
				o_load(&o,&n);
			break;
			case 2:
				printf(" │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n");
				if(o_name(o.name,0)){
					o.n=1;
					o.head=o_add(o.head,spriter(NULL,0));
					n=1;
				}
			break;
		}
		if(n==1)
			editor(o);
	}while(n);
	printf("\033c");
return 0;
}

void bootanim(int m){
	if(m){
		FILE *a=fopen("readme.txt","w");
		fprintf(a,"\t\t\t\t\t[  Visual T  ]\n\t\t\t\t\t[   Editor   ]\n\nReadme{\n\tthis ascii editor should be used together with the VisualT library\n\tit creates and edites object files ready to be imported in your surce\n}\n\nControls{\n\tEditor[\n\t\t|arrow keys left-right|\t\tto scroll the sprites\n\t\t|arrow keys up-down|\t\tto move the selected sprite forward/backward\n\t\t|enter|\t\t\t\tto add a new sprite\n\t\t|space|\t\t\t\tto edit the selected sprite\n\t\t|delete|\t\t\tto delete the selected sprite\n\t\t|s|\t\t\t\tto swap two sprites\n\t\t|d|\t\t\t\tto duplicate the selected sprite\n\t\t|p|\t\t\t\tto get a panorama of all the sprites\n\t\t|n|\t\t\t\tto change the object's name\n\t\t|x|\t\t\t\tto exit\n\t]\n\tSprite Painter[\n\t\t|delete|\t\t\tdraw a trasparent character\n\t\tall the controls from now on must be pressed together with the |ctrl| key\n\t\t|q|\t\t\t\thide/show grid\n\t\t|space|\t\t\t\tdraw a special character (1-9)\n\t\t|w-a-s-d|\t\t\tenlarge canvas up-left-down-right\n\t\t|e-r|\t\t\t\tmirror horizontally-vertically\n\t\t|t-f-g-h|\t\t\tshrink canvas up-left-down-right\n\t\t|y|\t\t\t\tmirror direction-oriented characters\n\t\t|u-j|\t\t\t\trotate clockwise-counter clockwise\n\t\t|i-k|\t\t\t\ttoggle horizontally-vertically writing\n\t\t|o|\t\t\t\tfill (paint bucket)\n\t\t|p|\t\t\t\tto print the canvas on text/PRINT.txt file\n\t\t|v|\t\t\t\tsave changes and exit\n\t\t|x|\t\t\t\tdiscard changes and exit\n\t]\n}\n\nWarnings{\n\tthe max sprite size is 200 x 40 (width x height)\n\t\".txt\" and \".obj\" files must be placed respectively in the \"text\" and \"obj\" folders,\n\tin the same level of the executable\n\tlet me know about bugs, glitch or problems you have encountered using the program\n\tyour help is highly appreciated\n}\n\nCredits{\n\tprogram written and designed by Mr. Fox(myself)\n\tspecial thanks to KayJay\n}");
		fclose(a);
		system("(mkdir text obj ; xdg-open readme.txt)");
	}
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │###################B#############QB##################│\n │##################B###############BB#################│\n │###############B##BBB###########BBQ###B#############Q│\n │#######Q#Q##BB######BBBBBBBBBBBQB#####QQBBQQ#Q#######│\n │###########BBQ######Q#B#B#BBB#B#########BBB##########│\n │#########BBBQ#######Q#B#B#BBB###########QBBB#########│\n │########BBBQBQ######Q#B#B#BBB############BQBBB#######│\n │#####QBBBBBBBBQQQQQ#B#B#B#BBQ#Q#Q#Q#Q#QQQBQBQBBB#####│\n │QQ###BBBBBBBBBBBBQBQBQB#B#BBBQBQQQBQBQBBBBQBQBQBB###Q│\n │$$$$#QBBBBBBBBBBBBBBBBBQB#BBBQBBBBBBBBBBBBBBQBQB##$$$│\n │Q####QBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBB#####│\n │######BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBB#####│\n │QQ####BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBB#####Q│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │###################B#############QB##################│\n │##################B###############BB#################│\n │################B#BBB###########BBB##BB#############Q│\n │#######Q#Q##BBB#Q#Q#BBBB#!!!!BB#B#####QBBBQQ#Q#######│\n │###########BBQQ#######QBB!  !BB########B#BB##########│\n │#########BBBB##########QB\"__3Q#########B#BQB#########│\n │########BBBQB########Q#Q##  #Q#Q#Q#Q#B#B#B#BBB#######│\n │#####QBBBQBQBQQQQQQQ#Q#Q#B\'\'BQ#B#B#B#B#B#B#B#BBB#####│\n │QQ###BBBBBBBBBBBBBBBBBBBBB+(#Q#B#B#B#B#B#B#B#B#BB###Q│\n │$$$$#QBBBBBBBBBBBBBBBBBBBB$$B#QBQBQB#B#B#B#B#B#B##$$$│\n │Q####QBBBBBBBBBBBBBBBBBBBBB#B#BBBBBBBBBBQBQBQBQB#####│\n │######BBBBBBBBBBBBBBBBBBBBBBBQBBBBBBBBBBBBBBBBBQ#####│\n │QQ####BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBB#####Q│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │###################B#############QB##################│\n │##################B###############BB#################│\n │###############QB#BBB###########BBB##BQ#############Q│\n │#######Q#Q##BBQQQ#B#BBu`\'!!!!\' %%B######BBBQQ#Q#######│\n │###########BBB#Q##Q#B#$.      .$#######B#BB##########│\n │#########BBBBB#Q#QQ#B##.\\ __ /.########B#BBB#########│\n │########BBBBBB#B#BQQB#Q `    ` ######B#B#BBBBB#######│\n │#####QBBBBBBBBQBQBQBBQB-     _.BQQQB#B#B#BBBB#BB#####│\n │QQ###BBBBBBBBBBBQBQBBBB!`q  p !BBBBBQB#BQBBQB#BBB###Q│\n │$$$$#BBBBBBBBBBBBBBBBBB(=/  \\=!BBBBBQBQBBBBBB#BB##$$$│\n │Q####BBBBBBBBBBBBBBBBBBI`\\()/`+BBBBBBBBBBBBBBBBB#####│\n │######BBBBBBBBBBBBBBBBB$      IBBBBBBBBBBBBBBBBQ#####│\n │QQ####BBBBBBBBBBBBBBBBB#{    }$BBBBBBBBBBBBBBBB#####Q│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │###################B#############QB##################│\n │##################B##################################│\n │###############B##B.!u#########$\"! ##BQ#############Q│\n │#######Q#Q##BBBB##B`   `\'!!!!\'     ##Q#BBBQQ#Q#######│\n │###########BB#BB#QB  ,-.      .-,  ##Q#BBBB##########│\n │#########BBBB#BB#QB  |-.\\ __ /.-|  #QQ#QBQBB#########│\n │########BBBBBQBB#BB  \\  `    `  /  #BB#BBQBBBB#######│\n │#####QBBBBBBBBBBQBB  / _     _  \\  #BBQBBBBBBBBB#####│\n │QQ###BBBBBBBBBBBBBB  | _`q  p _ |  BBBBBBBBBBBBBB###Q│\n │$$$$#BBBBBBBBBBBBBB  \'._=/  \\=_.\'  BBBBBBBBBBBBB##$$$│\n │Q####QBBBBBBBBBBBBB    {`\\()/`}`\\ `BBBBBBBBBBBBB#####│\n │######BBBBBBBBBBBBB    {      }  \\.BBBBBBBBBBBBQ#####│\n │QQ####BBBBBBBBBBBBB    |{    }    .BBBBBBBBBBBB#####Q│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │###################B#############QB##################│\n │#################$$################j#################│\n │###############$`  `!u#########$\"!   \'\"#############Q│\n │#######Q#Q##BBBj       `\'!!!!\'        \'BBB#Q#Q#######│\n │###########BBBB3     ,-.      .-,     !BBBB##########│\n │#########BBBBBQ%%     |-.\\ __ /.-|     !BBBBB#########│\n │########BBBBBBB%%     \\  `    `  /     \"BBBBBBB#######│\n │#####QBBBBBBBBB$     / _     _  \\     3BBBBBBBBB#####│\n │QQ###BBBBBBBBBB$     | _`q  p _ |     $BBBBBBBBBB###Q│\n │$$$$#BBBBBBBBBB$     \'._=/  \\=_.\'     #BBBBBBBBB##$$$│\n │Q####QBBBBBBBBB#       {`\\()/`}`\\     #BBBBBBBBB#####│\n │######BBBBBBBBB#       {      }  \\    BBBBBBBBB######│\n │QQ####BBBBBBBBB#       |{    }    \\  .BBBBBBBBB#####Q│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │###################B#############QB##################│\n │#################$$################j#################│\n │##############3!`  `!u#########$\"!   \'($############Q│\n │#######Q#Q###!         `\'!!!!\'          (####Q#######│\n │###########B!        ,-.      .-,        !###########│\n │#########QBB!        |-.\\ __ /.-|         BB#########│\n │########BBBB!        \\  `    `  /         BBBB#######│\n │######BBBBBB!        / _     _  \\         BBBBBB#####│\n │QQ###BBBBBBB!        | _`q  p _ |         BBBBBBB###Q│\n │$$$$#BBBBBBB!        \'._=/  \\=_.\'        `BBBBBB##$$$│\n │Q####QBBBBBB!          {`\\()/`}`\\        `BBBBBB#####│\n │######BBBBBB!          {      }  \\       `BBBBBQ#####│\n │QQ####BBBBBB!          |{    }    \\      `BBBBB#####Q│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │###################B#############QB##################│\n │#################$$################j#################│\n │##############3!`  `!u#########$\"!   \'($############Q│\n │#######Q#Q###!         `\'!!!!\'          (####Q#######│\n │############*        ,-.      .-,       !############│\n │###########\'         |-.\\ __ /.-|        `3##########│\n │########QB!          \\  `    `  /          3B########│\n │#######BBB!          / _     _  \\          IBBB######│\n │B##QBBBBBB!          | _`q  p _ |          tBBBBQ####│\n │$$$$##BBBB!          \'._=/  \\=_.\'          \"BBB##$$$$│\n │BQ####BBBB!            {`\\()/`}`\\          \"BBB######│\n │B#####BBBB!            {      }  \\         \"BBB######│\n │BQ####QBBB!            |{    }    \\        \"BBQ######│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │###################B#############QB##################│\n │#################$$################j#################│\n │##############3!`  `!u#########$\"!   \'($############Q│\n │#######Q#Q###!         `\'!!!!\'          (####Q#######│\n │############*        ,-.      .-,       !############│\n │##########$\'         |-.\\ __ /.-|        `3##########│\n │#########\"           \\  `    `  /          !#########│\n │#######BB!           / _     _  \\           \"BB######│\n │B##QBBBBB!           | _`q  p _ |           \"BBBQ####│\n │$$$$##BBB!           \'._=/  \\=_.\'           \"BB##$$$$│\n │BQ####BBB!             {`\\()/`}`\\           \"BB######│\n │B#####BBB!             {      }  \\          \"BB######│\n │BQ#####BB!             |{    }    \\         \"B#######│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │###################B#############QB##################│\n │#################$$################j#################│\n │##############3!`  `!u#########$\"!   \'($############Q│\n │#######Q#Q###!         `\'!!!!\'          (####Q#######│\n │###########$.        ,-.      .-,        !###########│\n │##########!          |-.\\ __ /.-|          \"#########│\n │########\"`           \\  `    `  /           .%%#######│\n │######$.             / _     _  \\             !######│\n │QB###+               | _`q  p _ |               $###Q│\n │$$$$#!               \'._=/  \\=_.\'               \"$$$$│\n │BQ####`                {`\\()/`}`\\              !#####│\n │Q#####I                {      }  \\             ######│\n │BB#####                |{    }    \\           \'#####B│\n └─────────────────────────────────────────────────────┘\n  ");
	sleepm(130);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │###################B#############QB##################│\n │#################$$################j#################│\n │##############3!`  `!u#########$\"!   \'($############Q│\n │#######Q#Q###!         `\'!!!!\'          (####Q#######│\n │###########$.        ,-.      .-,        !###########│\n │##########!          |-.\\ __ /.-|          \"#########│\n │########\"`           \\  `    `  /           .%%#######│\n │######$.             / _     _  \\             !######│\n │QB###+               | _`q  p _ |               $###Q│\n │$$$$#!               \'._=/  \\=_.\'               \"$$$$│\n │BQ####`                {`\\()/`}`\\              !#####│\n │Q#####I                {      }  \\             ######│\n │BB#####                |{    }    \\           \'#####B│\n └─────────────────────────────────────────────────────┘\n  ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                                                     │\n │                                                     │\n │###################B#############QB##################│\n │#################$$##,-.######.-,##j#################│\n │##############3!`  `!|-.\\ __ /.-|!   \'($############Q│\n │#######Q#Q###!       \\  `    `  /       (####Q#######│\n │###########$.        / _     _  \\        !###########│\n │##########!          | _`q  p _ |          \"#########│\n │########\"`           \'._=/  \\=_.\'           .%%#######│\n │######$.               {`\\()/`}`\\             !######│\n │QB###+                 {      }  \\              $###Q│\n │$$$$#!                 |{    }    \\             \"$$$$│\n │BQ####`                \\ \'--\'   .- \\           !#####│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                                                     │\n │                                                     │\n │                     ,-.      .-,                    │\n │                     |-.\\ __ /.-|                    │\n │###################B#\\  `    `  /QB##################│\n │#################$$##/ _     _  \\##j#################│\n │##############3!`  `!| _`q  p _ |!   \'($############Q│\n │#######Q#Q###!       \'._=/  \\=_.\'       (####Q#######│\n │###########$.          {`\\()/`}`\\        !###########│\n │##########!            {      }  \\         \"#########│\n │########\"`             |{    }    \\         .%%#######│\n │######$.               \\ \'--\'   .- \\          !######│\n │QB###+                 |-      /    \\           $###Q│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                                                     │\n │                     ,-.      .-,                    │\n │                     |-.\\ __ /.-|                    │\n │                     \\  `    `  /                    │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │###################B#\'._=/  \\=_.\'QB##################│\n │#################$$####{`\\()/`}`\\##j#################│\n │##############3!`  `!u#{      }  \\   \'($############Q│\n │#######Q#Q###!         |{    }    \\     (####Q#######│\n │###########$.          \\ \'--\'   .- \\     !###########│\n │##########!            |-      /    \\      \"#########│\n │########\"`             | | | | |     ;      .%%#######│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     ,-.      .-,                    │\n │                     |-.\\ __ /.-|                    │\n │                     \\  `    `  /                    │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │###################B###|{    }    \\##################│\n │#################$$####\\ \'--\'   .- \\#################│\n │##############3!`  `!u#|-      /    \\\'($############Q│\n │#######Q#Q###!         | | | | |     ;  (####Q#######│\n │###########$.          | | |.;.,..__ |   !###########│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     |-.\\ __ /.-|                    │\n │                     \\  `    `  /                    │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │                       |-      /    \\                │\n │###################B###| | | | |     ;###############│\n │#################$$####| | |.;.,..__ |###############│\n │##############3!`  `!.-\"\";`         `|($############Q│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     \\  `    `  /                    │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │                       |-      /    \\                │\n │                       | | | | |     ;               │\n │                       | | |.;.,..__ |               │\n │                     .-\"\";`         `|               │\n │###################B/    |           /###############│\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │                       |-      /    \\                │\n │__                     | | | | |     ;               │\n │_/                     | | |.;.,..__ |               │\n │                     .-\"\";`         `|               │\n │                    /    |           /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │                       |-      /    \\                │\n │_  __                  | | | | |     ;               │\n │ |/_/                  | | |.;.,..__ |               │\n │  <                  .-\"\";`         `|               │\n │|_|                 /    |           /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │                       |-      /    \\                │\n │_  _  __               | | | | |     ;               │\n │ \\| |/_/               | | |.;.,..__ |               │\n │ />  <               .-\"\";`         `|               │\n │/_/|_|              /    |           /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │_                      |-      /    \\                │\n │/___  _  __            | | | | |     ;               │\n │ __ \\| |/_/            | | |.;.,..__ |               │\n │/_/ />  <            .-\"\";`         `|               │\n │___/_/|_|           /    |           /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │____                   |-      /    \\                │\n │ __/___  _  __         | | | | |     ;               │\n │/_/ __ \\| |/_/         | | |.;.,..__ |               │\n │_/ /_/ />  <         .-\"\";`         `|               │\n │ \\____/_/|_|        /    |           /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │   ____                |-      /    \\                │\n │  / __/___  _  __      | | | | |     ;               │\n │ / /_/ __ \\| |/_/      | | |.;.,..__ |               │\n │/ __/ /_/ />  <      .-\"\";`         `|               │\n │_/  \\____/_/|_|     /    |           /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │      ____             |-      /    \\                │\n │__   / __/___  _  __   | | | | |     ;               │\n │_/  / /_/ __ \\| |/_/   | | |.;.,..__ |               │\n │   / __/ /_/ />  <   .-\"\";`         `|               │\n │  /_/  \\____/_/|_|  /    |           /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │         ____          |-      /    \\                │\n │_____   / __/___  _  __| | | | |     ;               │\n │ ___/  / /_/ __ \\| |/_/| | |.;.,..__ |               │\n │/     / __/ /_/ />  <.-\"\";`         `|               │\n │     /_/  \\____/_/|_|    |           /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │            ____       |-      /    \\                │\n │_  _____   / __/___  _ |__ | | |     ;               │\n │ \\/ ___/  / /_/ __ \\| |/_/ |.;.,..__ |               │\n │ / /     / __/ /_/ />  <\";`         `|               │\n │/_/     /_/  \\____/_/|_| |           /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │               ____    |-      /    \\                │\n │ ___  _____   / __/___ |_| __| |     ;               │\n │`__ \\/ ___/  / /_/ __ \\| |/_/;.,..__ |               │\n │/ / / /     / __/ /_/ />  <         `|               │\n │ /_/_/     /_/  \\____/_/|_|          /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │                  ____ |-      /    \\                │\n │___ ___  _____   / __/___| _ |__     ;               │\n │__ `__ \\/ ___/  / /_/ __ \\| |/_/..__ |               │\n │ / / / / /     / __/ /_/ />  <      `|               │\n │/_/ /_/_/     /_/  \\____/_/|_|       /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │                     ____      /    \\                │\n │  ____ ___  _____   / __/___ |_| __  ;               │\n │ / __ `__ \\/ ___/  / /_/ __ \\| |/_/_ |               │\n │/ / / / / / /     / __/ /_/ />  <   `|               │\n │_/ /_/ /_/_/     /_/  \\____/_/|_|    /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │                       |____   /    \\                │\n │     ____ ___  _____   / __/___| _  __               │\n │    / __ `__ \\/ ___/  / /_/ __ \\| |/_/               │\n │   / / / / / / /     / __/ /_/ />  <`|               │\n │  /_/ /_/ /_/_/     /_/  \\____/_/|_| /               │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │                       |-  ____/    \\                │\n │        ____ ___  _____| |/ __/___  _; __            │\n │       / __ `__ \\/ ___/| / /_/ __ \\| |/_/            │\n │      / / / / / / /  .-\"/ __/ /_/ />  <              │\n │     /_/ /_/ /_/_/  /  /_/  \\____/_/|_|              │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │                       |-     ____  \\                │\n │           ____ ___  _____ | / __/___; _  __         │\n │          / __ `__ \\/ ___/ |/ /_/ __ \\| |/_/         │\n │         / / / / / / /-\"\";`/ __/ /_/ />  <           │\n │        /_/ /_/ /_/_/    |/_/  \\____/_/|_|           │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(80);
	printf("\033c ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │                     / _     _  \\                    │\n │                     | _`q  p _ |                    │\n │                     \'._=/  \\=_.\'                    │\n │                       {`\\()/`}`\\                    │\n │                       {      }  \\                   │\n │                       |{    }    \\                  │\n │                       \\ \'--\'   .- \\                 │\n │                       |-      / ____                │\n │              ____ ___ |_____| |/ __/___  _  __      │\n │             / __ `__ \\/ ___/;./ /_/ __ \\| |/_/      │\n │            / / / / / / /;`   / __/ /_/ />  <        │\n │           /_/ /_/ /_/_/ |   /_/  \\____/_/|_|        │\n │                    `-../____,..---\'`                │\n └─────────────────────────────────────────────────────┘\n ");
	sleepm(1500);
}

void editor(obj o){
	int v,i=1;
	sprite* p=o.head;

	do{
		printf("\033c");
		printf(" [ %s ]\n",o.name);
		s_show(p->mna,p->sx,p->sy,0);
		printf(" ↼ [ sprite %d/%d ] ⇀\n ",i,o.n);
		v=getch(0);
		switch(v){
			case 68://sinistra
				p=p->pre;
				i=(i+o.n-2)%o.n+1;
			break;
			case 67://destra
				p=p->nxt;
				i=i%o.n+1;
			break;
			case 65://su
				if(i<o.n){
					o_move(p,p->nxt);
					p=p->nxt;
					i++;
				}
			break;
			case 66://giu
				if(i>1){
					o_move(p,p->pre);
					p=p->pre;
					i--;
				}
			break;
			case 112://p
				o_panorama(o.head,o.n);
				getch(0);
			break;
			case 10://invio
				p=spriter(NULL,1);
				if(p==NULL){
					for(p=o.head,v=1;v<i;p=p->nxt,v++);
				}
				else{
					o.n++;
					o.head=o_add(o.head,p);
					i=o.n;
				}
			break;
			case 127://del
				if(o.n>1){
					o.head=o_delete(o.head,p);
					o.n--;
					for(p=o.head,v=1;v<i&&v<o.n;p=p->nxt,v++);
					i=v;
				}
			break;
			case 115://s
				printf("[ swap with sprite n:    ]\b\b\b\b");
				scanf("%d",&v);
				while(getchar()!='\n');
				if(v>0&&v<=o.n)
					o_swap(o.head,p,v);
				v=1;
			break;
			case 100://d
				o_clone(p);
				p=p->nxt;
				i++;
				o.n++;
			break;
			case 32://spazio
				p=spriter(p,2);
			break;
			case 110://n
				printf("┌─────────────────────────────────────────────────────┐\n");
				o_name(o.name,1);
			break;
			case 120://x
				do{
					printf("\033c");
					printf(" ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │ What do you want to do:                             │\n │                                                     │\n │ 1. save and exit                                    │\n │ 2. discard and exit                                 │\n │ 0. cancel                                           │\n                                                       │\n └─────────────────────────────────────────────────────┘\033[F │ ☛  ");
					v=rd()+1;
				}while(v<1||v>3);
				switch(v){
					case 2:
						o_save(o);
					case 3:
						v=0;
					break;
				}
			break;
		}
	}while(v);
	do{
		o.head=o_delete(o.head,o.head);
		o.n--;
	}while(o.n>0);
}

void o_load(obj *o,int *n){
	int i;
	char b[17],c[6];
	FILE *a;

	do{
		i=1;
		if(!system("(cd ./obj/ && ls -c *.obj)")){
			strcpy(b,"./obj/");
			printf(" ┬ file name (max 5, no spaces)|                       ┬\n                                                       │\n └─────────────────────────────────────────────────────┘\033[F │ 0 to exit                   : ");
			scanf("%5s",c);
			while(getchar()!='\n');
			if(!(c[0]=='0'&&c[1]=='\0')){
				strcat(b,c);
				strcat(b,".obj");
				printf("\n\033[F                                                       │\r │ searching \"%s\"\n",b);
				a=fopen(b,"r");
				if(a==NULL){
					printf(" │                                                     │\n                                                       │\r │ \"%s.obj\" doesn't exist in \"obj\" folder\n",c);
					i=0;
				}
				else{
					if((i=o_scan(a,c))){
						o_make(a,o);
						printf(" │                                                     │\n │                   ! file loaded !                   │\n │              press any key to continue              │\n └─────────────────────────────────────────────────────┘\n ");
						getch(0);
						printf("\033c");
					}
					fclose(a);
				}
			}
			else
				*n=2;
		}
		else{
			*n=2;
			printf(" ┬  ! the \"obj\" folder seems to have no .obj files !   ┬\n └─────────────────────────────────────────────────────┘\n ");
			getch(0);
		}
		if(!i)
			printf(" ┴                                                     ┴\n");
	}while(i==0);
}

int o_scan(FILE *a,char b[]){
	int d=1;

	if(getc(a)==-1){
		printf(" │                                                     │\n                                                       │\r │ \"%s.txt\" is an empty file\n",b);
		d=0;
	}
	rewind(a);
return d;
}

void o_make(FILE *a,obj *o){
	int **mna,sx,sy,x,y,i;

	for(x=0,i=1;x<6;x++){
		fscanf(a,"%d",&y);
		o->name[x]=y;
	}
	fscanf(a,"%d",&o->n);
	for(i=0;i<o->n;i++){
		fscanf(a,"%d",&sx);
		fscanf(a,"%d",&sy);
		mna=malloc(sizeof(int*)*sx);
		for(x=0;x<sx;x++)
			mna[x]=malloc(sizeof(int)*sy);
		for(y=0;y<sy;y++){
			for(x=0;x<sx;x++){
				fscanf(a,"%d",&mna[x][y]);
			}
		}
		o->head=o_add(o->head,o_new(mna,sx,sy));
	}
}

sprite* o_add(sprite *head,sprite *s){
	if(head==NULL)
		head=s;
	else{
		s->pre=head->pre;
		s->pre->nxt=s;
	}
	s->nxt=head;
	head->pre=s;
return head;
}

sprite* o_new(int **mna,int sx,int sy){
	sprite *s=malloc(sizeof(sprite));

	s->mna=mna;
	s->sx=sx;
	s->sy=sy;
return s;
}

sprite* o_delete(sprite *head,sprite *s){
	if(s==head)
		head=head->nxt;
	s->pre->nxt=s->nxt;
	s->nxt->pre=s->pre;
	freem(s->mna,s->sx);
	free(s);
return head;
}

void o_swap(sprite *head,sprite *s,int a){
	int **ta=s->mna,tb=s->sx,tc=s->sy;
	sprite *p;

	for(p=head;a>1;p=p->nxt,a--);
	s->mna=p->mna;
	s->sx=p->sx;
	s->sy=p->sy;
	p->mna=ta;
	p->sx=tb;
	p->sy=tc;
}

void o_move(sprite *s,sprite *p){
	int **ta=s->mna,tb=s->sx,tc=s->sy;

	s->mna=p->mna;
	s->sx=p->sx;
	s->sy=p->sy;
	p->mna=ta;
	p->sx=tb;
	p->sy=tc;
}

void o_clone(sprite *s){
	int x,y;
	sprite *p=o_new(NULL,s->sx,s->sy);

	p->mna=malloc(sizeof(int*)*(p->sx));
	for(x=0;x<p->sx;x++)
		p->mna[x]=malloc(sizeof(int)*(p->sy));
	for(y=0;y<p->sy;y++){
		for(x=0;x<p->sx;x++)
			p->mna[x][y]=s->mna[x][y];
	}
	p->pre=s;
	p->nxt=s->nxt;
	s->nxt->pre=p;
	s->nxt=p;
}

void o_panorama(sprite *head,int n){
	int i;
	sprite *p=head;

	for(i=1;i<=n;i++){
		printf("\n [ sprite %d ]\n",i);
		s_show(p->mna,p->sx,p->sy,0);
		p=p->nxt;
	}
	printf(" ");
}

int o_name(char n[],int ste){
	int e;
	char t[6];
		do{
			e=0;
			printf(" │ new obj name (max 5, no spaces)|                    │\n                                                       │\n └─────────────────────────────────────────────────────┘\033[F │ 0 to exit                      : ");
			scanf("%5s",t);
			while(getchar()!='\n');
			if(!(t[0]=='0'&&t[1]=='\0')){
				printf("\r                                                       │\n └─────────────────────────────────────────────────────┘\033[F │ you entered \"%s\", confirm? (y/n): ",t);
				do{
					e=getch(0);
				}while(e!='y'&&e!='n');
				printf("%c\n",e);
				if(e=='y'){
					if(ste)
						sysbr(1,n,t);
					for(e=0;e<6;n[e]=t[e],e++);
				}
			}
		}while(e=='n');
return e;
}

void o_save(obj o){
	int i,x,y;
	char b[17];
	sprite *p;
	FILE *a;

	strcpy(b,"./obj/");
	strcat(b,o.name);
	strcat(b,".obj");
	a=fopen(b,"w");
	for(i=0;o.name[i]!=0;i++)
		fprintf(a,"%d ",o.name[i]);
	for(;i<6;i++)
		fprintf(a,"0 ");
	fprintf(a,"%d ",o.n);
	for(i=0,p=o.head;i<o.n;i++){
		fprintf(a,"%d ",p->sx);
		fprintf(a,"%d ",p->sy);
		for(y=0;y<p->sy;y++){
			for(x=0;x<p->sx;x++){
				fprintf(a,"%d ",p->mna[x][y]);
			}
		}
		p=p->nxt;
	}
	fclose(a);
}

sprite* spriter(sprite *s,int ste){
	int **mna,sx,sy,n=3,t=1;
	//0 first, 1 new, 2 edit
	//ste: modalità | n: scelta/uscita | t: multi
	//exit status < load 0 | exit 1 | succes 2 | draw 3 >
	do{
		if(ste<2){
			s=NULL;
			printf("\033c");
			printf(" ┌─────────────────────────────────────────────────────┐\n │ᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ╲  Visual T  ╱ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐ│\n │ʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ╱   Editor   ╲ᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣᵐʳᶠᵒˣ│\n │ ┄┄╌─────────────────────────────────────────────╌┄┄ │\n │ What do you want to do:                             │\n │                                                     │\n │ 1. load a text file                                 │\n │ 2. draw a sprite                                    │\n");
			if(ste)
				printf(" │ 0. exit                                             │\n");
			printf("                                                       │\n └─────────────────────────────────────────────────────┘\033[F │ ☛  ");
			n=rd()+1;
		}
		if(!ste){
			if(n==1)
				n=0;
			ste=1;
			t=0;
		}
		switch(n){
			case 2:
				printf(" ┴ ┄┄╌─────────────────────────────────────────────╌┄┄ ┴\n");
				mna=s_load(&sx,&sy,&n);
			break;
			case 3:
				if(ste<2){
					sx=1;
					sy=1;
				}
				else{
					sx=s->sx;
					sy=s->sy;
				}
				mna=malloc(sizeof(int*)*sx);
				for(n=0;n<sx;n++)
					mna[n]=malloc(sizeof(int)*sy);
				if(ste==2){
					for(n=0;n<sy;n++){
						for(t=0;t<sx;t++)
							mna[t][n]=s->mna[t][n];
					}
				}
				else
					mna[0][0]=32;
				n=2;
			break;
		}
		if(n==2)
			mna=s_draw(mna,&sx,&sy,&n);
		switch(n){
			case 3:
				freem(mna,sx);
				if(ste<2)
					n=0;
				else
					n=1;
			break;
			case 2:
				if(ste<2)
					s=o_new(mna,sx,sy);
				else{
					freem(s->mna,s->sx);
					s->sx=sx;
					s->sy=sy;
					s->mna=mna;
				}
			break;
		}
		if(!t)
			ste=0;
	}while(n<1||n>2);
return s;
}

int** s_load(int *sx,int *sy,int *n){
	int **mna,i;
	char b[17],c[6];
	FILE *a;

	do{
		i=1;
		if(!system("(cd ./text/ && ls -c *.txt)")){
			strcpy(b,"./text/");
			printf(" ┬ file name (max 5, no spaces)|                       ┬\n                                                       │\n └─────────────────────────────────────────────────────┘\033[F │ 0 to exit                   : ");
			scanf("%5s",c);
			while(getchar()!='\n');
			if(!(c[0]=='0'&&c[1]=='\0')){
				strcat(strcat(b,c),".txt");
				printf("\n\033[F                                                       │\r │ searching \"%s\"\n",b);
				a=fopen(b,"r");
				if(a==NULL){
					printf(" │                                                     │\n                                                       │\r │ \"%s.obj\" doesn't exist in \"text\" folder\n",c);
					i=0;
				}
				else{
					printf(" ┴                     .:preview:.                     ┴\n");
					sysbr(0,"text",c);
					if((i=s_scan(a,c))){
						do{
							i=getch(0);
						}while(i!='y'&&i!='n');
						printf("%c\n",i);
						switch(i){
							case 'n':
								i=0;
							break;
							case 'y':
								mna=s_make(a,sx,sy);
								printf(" │                                                     │\n │                   ! file loaded !                   │\n │              press any key to continue              │\n └─────────────────────────────────────────────────────┘\n ");
								getch(0);
								printf("\033c");
							break;
						}
					}
					fclose(a);
				}
			}
			else
				*n=0;
		}
		else{
			*n=0;
			printf(" ┬  ! the \"text\" folder seems to have no .txt files !  ┬\n └─────────────────────────────────────────────────────┘\n ");
			getch(0);
		}
		if(!i)//||!*n
			printf(" ┴                                                     ┴\n");
	}while(i==0);
return mna;
}

int s_scan(FILE *a,char b[]){
	char c;
	int d;

	printf("                                                       ┬\n └─────────────────────────────────────────────────────┘\033[F ┬ ");
	for(d=0;fscanf(a,"%c",&c)!=-1&&d>-1;d++){
		if((c<32||c>250)&&c!='\n'){
			printf("\r ┬                   ! (ch n.%d) !\n │            non-ascii character detected             │\n │it might work, but the program could act unexpectedly│\n │                  use with caution                   │\n │                                                     │\n                                                       │\n └─────────────────────────────────────────────────────┘\033[F │ ",d+1);
			d=-2;
		}
	}
	if(d)
		printf("is this the file? (y/n): ");
	else
		printf("\"%s.txt\" is an empty file\n",b);
	rewind(a);
return d;
}

int** s_make(FILE *a,int *sx,int *sy){
	int **mna,x=0,y,i;
	char *c;

	for(i=0;getc(a)!=-1;i++);
	c=malloc(sizeof(char)*(i));
	i--;
	c[i]=0;
	rewind(a);
	for(y=0;y<i;y++)
		c[y]=getc(a);
	for(i=0;c[i+1];i++){
		if(c[i]==92&&((c[i+1]==92&&(c[i+2]==118||(c[i+2]>48&&c[i+2]<58)))||c[i+1]==118||(c[i+1]>48&&c[i+1]<58))){
			if(c[i+1]!=92){
				if(c[i+1]==118)
					c[i]=11;
				else
					c[i]=c[i+1]-48;
			}
			for(y=i+1;c[y+1];y++)
				c[y]=c[y+1];
			c[y]=0;
		}
	}
	*sx=0;
	*sy=0;
	i=0;
	do{
		if(c[i]=='\n'||!c[i]){
			(*sy)++;
			if(x>*sx)
				*sx=x;
			x=0;
		}
		else
			x++;
		i++;
	}while(c[i-1]);
	mna=malloc(sizeof(int*)*(*sx));
	for(x=0;x<*sx;x++)
		mna[x]=malloc(sizeof(int)*(*sy));
	for(i=0,y=0;y<*sy;y++){
		for(x=0;x<*sx;x++,i++){
			if(c[i]=='\n'||!c[i]){
				while(x<*sx){
					mna[x][y]=32;
					x++;
				}
			}
			else
				mna[x][y]=c[i];
			if(x==*sx-1&&c[i+1]=='\n')
				i++;
		}
	}
	free(c);
	for(y=0;y<*sy;y++){
		for(x=0;x<*sx;x++){
			if(mna[x][y]==11)
				mna[x][y]=0;
		}
	}
return mna;
}

void s_show(int **mna,int sx,int sy,int g){
	int x,y;

	printf(" ┌");
	for(x=0;x<sx-1;x++){
		if(g)
			printf("─┬");
		else
			printf("─");
	}
	printf("─┐\n");
	for(y=0;y<sy;y++){
		printf(" │");
		for(x=0;x<sx;x++){
			switch(mna[x][y]){
				case -1:
					printf("◊");
				break;
				case 0:
					printf("×");
				break;
				case 1:
					printf("│");
				break;
				case 2:
					printf("─");
				break;
				case 3:
					printf("┌");
				break;
				case 4:
					printf("┐");
				break;
				case 5:
					printf("└");
				break;
				case 6:
					printf("┘");
				break;
				case 7:
					printf("░");
				break;
				case 8:
					printf("▒");
				break;
				case 9:
					printf("▓");
				break;
				default:
					putchar(mna[x][y]);
				break;
			}
			if(g||x==sx-1)
				printf("│");
		}
		if(g&&y<sy-1){
			printf("\n ├");
			for(x=0;x<sx;x++){
				if(x<sx-1)
					printf("─┼");
			}
			printf("─┤");
		}
		printf("\n");
	}
	printf(" └");
	for(x=0;x<sx-1;x++){
		if(g)
			printf("─┴");
		else
			printf("─");
	}
	printf("─┘\n");
}

int** s_draw(int **mna,int *sx,int *sy,int *n){
	int x=0,y=0,t,v,g=0,mx=0,my=0;

	t=mna[x][y];
	mna[x][y]=-1;
	do{
		printf("\033c");
		printf(" [ Sprite Painter ]\n");
		s_show(mna,*sx,*sy,g);
		printf(" [ pos %d;%d│size %d;%d│lateral: ",x,y,*sx,*sy);
		if(mx)
			printf("on ");
		else
			printf("off");
		printf("│vertical: ");
		if(my)
			printf("on ");
		else
			printf("off");
		printf("│");
		if(g)
			printf("grid]\n ");
		else
			printf("normal ]\n ");
		v=spe(getch(1));
		if(v>-1){
			mna[x][y]=v;
			if(mx)
				x=((x+1)%*sx);
			if(my)
				y=((y+1)%*sy);
			t=mna[x][y];
			if(mx||my)
				mna[x][y]=-1;
		}
		else{
			v=-v;
			mna[x][y]=t;
			switch(v){
				case '\033':
					getchar();
					v=getchar();
					switch(v){
						case 'A':
							y=(y+*sy-1)%*sy;
						break;
						case 'B':
							y=(y+1)%*sy;
						break;
						case 'D':
							x=(x+*sx-1)%*sx;
						break;
						case 'C':
							x=(x+1)%*sx;
						break;
					}
				break;
				case 17://q
					g=!g;
				break;
				case 9://i
					mx=!mx;
				break;
				case 11://k
					my=!my;
				break;
				case 25://y
					s_mirror(mna,*sx,*sy);
				break;
				case 23://w
					if(*sy<40){
						mna=s_resize(mna,sx,sy,3,0);
						y=((y+1)%*sy);
					}
				break;
				case 1://a
					if(*sx<200){
						mna=s_resize(mna,sx,sy,1,0);
						x=((x+1)%*sx);
					}
				break;
				case 19://s
					if(*sy<40)
						mna=s_resize(mna,sx,sy,4,0);
				break;
				case 4://d
					if(*sx<200)
						mna=s_resize(mna,sx,sy,2,0);
				break;

				case 20://t
					if(*sy>1){
						mna=s_resize(mna,sx,sy,3,1);
						y=((y+*sy-1)%*sy);
					}
				break;
				case 6://f
					if(*sx>1){
						mna=s_resize(mna,sx,sy,1,1);
						x=((x+*sx-1)%*sx);
					}
				break;
				case 7://g
					if(*sy>1){
						mna=s_resize(mna,sx,sy,4,1);
						y=y%*sy;
					}
				break;
				case 8://h
					if(*sx>1){
						mna=s_resize(mna,sx,sy,2,1);
						x=x%*sx;
					}
				break;
				case 5://e
					s_invert(mna,*sx,*sy,0);
					x=(*sx-x-1)%*sx;
				break;
				case 18://r
					s_invert(mna,*sx,*sy,1);
					y=(*sy-y-1)%*sy;
				break;
				case 21://u j
				case 10:
					mna=s_rotate(mna,sx,sy,(21-v)/11);
					x=0;
					y=0;
				break;
				case 15://o
					printf("[ fill:   ]\b\b\b");
					t=spe(getch(0));
					if(t>-1&&mna[x][y]!=t)
						s_fill(mna,*sx,*sy,x,y,mna[x][y],t);
				break;
				case 16:
					s_print(mna,*sx,*sy);
					printf("[ printed to PRINT.txt ]\n ");
					getch(0);
				break;
				case 24://x
					*n=3;
				break;
			}
			t=mna[x][y];
			mna[x][y]=-1;
		}
	}while(v!=24&&v!=22);
	mna[x][y]=t;
return mna;
}

void s_invert(int **mna,int sx,int sy,int ste){
	int a,b,t;

	switch(ste){
		case 0:
			for(sy--;sy>-1;sy--){
				for(a=0,b=sx-1;sx-2*a>1;a++,b--){
					t=mna[a][sy];
					mna[a][sy]=mna[b][sy];
					mna[b][sy]=t;
				}
			}
		break;
		case 1:
			for(sx--;sx>-1;sx--){
				for(a=0,b=sy-1;sy-2*a>1;a++,b--){
					t=mna[sx][a];
					mna[sx][a]=mna[sx][b];
					mna[sx][b]=t;
				}
			}
		break;
	}
}

void s_mirror(int **mna,int sx,int sy){
	int x,y;

	for(y=0;y<sy;y++){
		for(x=0;x<sx;x++){
			switch(mna[x][y]){
				case '\\':
					mna[x][y]='/';
				break;
				case '/':
					mna[x][y]='\\';
				break;
				case '(':
					mna[x][y]=')';
				break;
				case ')':
					mna[x][y]='(';
				break;
				case '[':
					mna[x][y]=']';
				break;
				case ']':
					mna[x][y]='[';
				break;
				case '{':
					mna[x][y]='{';
				break;
				case '}':
					mna[x][y]='}';
				break;
				case '`':
					mna[x][y]='\'';
				break;
				case '\'':
					mna[x][y]='`';
				break;
				case '<':
					mna[x][y]='>';
				break;
				case '>':
					mna[x][y]='<';
				break;
			}
		}
	}
}

int** s_resize(int **mna,int *sx,int *sy,int m,int ste){
	int **t,x,y,a=0,b=0,dx=0,dy=0;
	//1:left 2:right 3:up 4:down
	switch(ste){
		case 0:
			switch(m){
				case 1:
				case 2:
					dx=1;
				break;
				case 3:
				case 4:
					dy=1;
				break;
			}
		break;
		case 1:
			switch(m){
				case 1:
				case 2:
					dx=-1;
				break;
				case 3:
				case 4:
					dy=-1;
				break;
			}
		break;
	}
	t=malloc(sizeof(int*)*(*sx+dx));
	for(x=0;x<*sx+dx;x++)
		t[x]=malloc(sizeof(int)*(*sy+dy));
	if(!ste){
		for(y=0;y<*sy+dy;y++){
			t[0][y]=32;
			t[*sx+dx-1][y]=32;
		}
		for(x=0;x<*sx+dx;x++){
			t[x][0]=32;
			t[x][*sy+dy-1]=32;
		}
	}
	if(m==3)
		b=1;
	for(y=0;y<*sy+(1-dy)/2*dy;a=0,b++,y++){//(1-x)/2*x
		if(m==1)
			a=1;
		for(x=0;x<*sx+(1-dx)/2*dx;a++,x++){
			if(ste)
				t[x][y]=mna[a][b];
			else
				t[a][b]=mna[x][y];
		}
	}
	freem(mna,*sx);
	mna=t;
	*sx+=dx;
	*sy+=dy;
return mna;
}

int** s_rotate(int **mna,int *sx,int *sy,int ste){
	int **t,x,y=*sx;

	if(y>40)
		y=40;
	t=malloc(sizeof(int*)*(*sy));
	for(x=0;x<*sy;x++)
		t[x]=malloc(sizeof(int)*y);
	for(y=0;y<*sy;y++){
		for(x=0;x<*sx&&x<40;x++){
			t[y][x]=mna[x][y];
		}
	}
	freem(mna,*sx);
	mna=t;
	x=*sx;
	*sx=*sy;
	*sy=x;
	if(*sy>40)
		*sy=40;
	s_invert(mna,*sx,*sy,ste);
return mna;
}

void s_fill(int **mna,int sx,int sy,int x,int y,int b,int p){
	if(x+1<sx&&mna[x+1][y]==b)
		s_fill(mna,sx,sy,x+1,y,b,p);
	if(y+1<sy&&mna[x][y+1]==b)
		s_fill(mna,sx,sy,x,y+1,b,p);
	mna[x][y]=p;
	if(x-1>-1&&mna[x-1][y]==b)
		s_fill(mna,sx,sy,x-1,y,b,p);
	if(y-1>-1&&mna[x][y-1]==b)
		s_fill(mna,sx,sy,x,y-1,b,p);
	mna[x][y]=p;
}

void s_print(int**mna,int sx,int sy){
	int x,y;
	FILE *a=fopen("./text/PRINT.txt","w");

	for(y=0;y<sy;y++){
		for(x=0;x<sx;x++){
			switch(mna[x][y]){
				case 0:
					fprintf(a,"\\v");
				break;
				case 1:
					fprintf(a,"\\1");
				break;
				case 2:
					fprintf(a,"\\2");
				break;
				case 3:
					fprintf(a,"\\3");
				break;
				case 4:
					fprintf(a,"\\4");
				break;
				case 5:
					fprintf(a,"\\5");
				break;
				case 6:
					fprintf(a,"\\6");
				break;
				case 7:
					fprintf(a,"\\7");
				break;
				case 8:
					fprintf(a,"\\8");
				break;
				case 9:
					fprintf(a,"\\9");
				break;
				default:
					putc(mna[x][y],a);
				break;
			}
		}
		fprintf(a,"\n");
	}
	fclose(a);
}
